PAY_CHOICES = (
    (0, "무료"),
    (1, "유료"),
)

IS_APPROVED_CHOICES = (
    (0, "비활성화"),
    (1, "활성화")
)

CATEGORY_DEACTIVATE = -99

BANK_CHOICES = (
    (0, "카카오뱅크"),
    (1, "농협"),
    (2, "신한"),
    (3, "IBK기업"),
    (4, "하나"),
    (5, "우리"),
    (6, "국민"),
    (7, "SC제일"),
    (8, "대구"),
    (9, "부산"),
    (10, "광주"),
    (11, "새마을금고"),
    (12, "경남"),
    (13, "전북"),
    (14, "제주"),
    (15, "산업"),
    (16, "우체국"),
    (17, "신협"),
    (18, "수협"),
    (19, "씨티"),
    (20, "케이뱅크"),
    (21, "도이치"),
    (22, "BOA"),
    (23, "BNP"),
    (24, "중국공상"),
    (25, "HSBC"),
    (26, "JP모간"),
    (27, "산림조합"),
    (28, "저축은행"),
)

PAY_STATUS_CHOICES = (
    (0, "대기중"),
    (1, "성공"),
    (2, "실패"),
    (3, "취소"),
    (4, "에러케이스")
)


PAY_STATUS_SUCCESS = 1
PAY_STATUS_FAIL = 2
PAY_STATUS_CANCEL = 3
PAY_STATUS_ERROR = 4


PAY_TYPE_CHOICES = (
    (0, "CARD"),
    (1, "MONEY"),
)

PAY_TYPE = {
    "CARD": 0,
    "MONEY": 1
}